In [46]:
import pandas as pd

In [47]:
df = pd.read_csv('../sample.csv')

In [48]:
df.head(7)

,sno,name,age,salary,designation,mobile,Unnamed: 6,Unnamed: 7
0,1.0,shabeeh abbas,23.0,89200,manager,9034878439,NaN,NaN
1,2.0,kashish,21.0,70000,manager,8798096088,NaN,NaN
2,3.0,nisha,24.0,$58809,region manager,9890869598,NaN,NaN
3,4.0,kriti,23.0,NaN,region magaer,8181098473,NaN,NaN
4,5.0,aditya sagar,NaN,89765,assistant manager,NaN,NaN,NaN
5,6.0,anjani soni,NaN,768659,manager,9867698609,NaN,NaN
6,7.0,aishwarya singh,35.0,89900,assisant manager,9869743758,NaN,NaN

In [49]:
df.isnull()

      sno   name    age  salary  designation  mobile  Unnamed: 6  Unnamed: 7
0   False  False  False   False        False   False        True        True
1   False  False  False   False        False   False        True        True
2   False  False  False   False        False   False        True        True
3   False  False  False    True        False   False        True        True
4   False  False   True   False        False    True        True        True
5   False  False   True   False        False   False        True        True
6   False  False  False   False        False   False        True        True
7   False  False  False   False        False   False        True        True
8   False  False  False   False         True   False        True        True
9   False  False  False   False        False   False        True        True
10   True   True   True    True         True    True        True        True
11   True   True   True    True         True    True        True        True
12   True   True   True    True         True    True        True        True
13   True   True   True    True         True    True        True        True

In [50]:
df.isnull().sum()

sno             4
name            4
age             6
salary          5
designation     5
mobile          5
Unnamed: 6     14
Unnamed: 7     14
dtype: int64

In [51]:
def salary_clean(salary):
    if isinstance(salary,str):
        salary = salary.strip()
        if '$' in salary:
            salary = salary.replace('$','')
        if ',' in salary:
            salary = salary.replace(',','')
        return int(salary)
    return salary

In [52]:
# test run
df['salary'].apply(salary_clean)

0      89200.0
1      70000.0
2      58809.0
3          NaN
4      89765.0
5     768659.0
6      89900.0
7     768994.0
8      86086.0
9      86098.0
10         NaN
11         NaN
12         NaN
13         NaN
Name: salary, dtype: float64

In [53]:
# final run
df['salary'] = df['salary'].apply(salary_clean)
df

,sno,name,age,salary,designation,mobile,Unnamed: 6,Unnamed: 7
0,1.0,shabeeh abbas,23.0,89200.0,manager,9034878439,NaN,NaN
1,2.0,kashish,21.0,70000.0,manager,8798096088,NaN,NaN
2,3.0,nisha,24.0,58809.0,region manager,9890869598,NaN,NaN
3,4.0,kriti,23.0,NaN,region magaer,8181098473,NaN,NaN
4,5.0,aditya sagar,NaN,89765.0,assistant manager,NaN,NaN,NaN
5,6.0,anjani soni,NaN,768659.0,manager,9867698609,NaN,NaN
6,7.0,aishwarya singh,35.0,89900.0,assisant manager,9869743758,NaN,NaN
7,8.0,mayank singh,80.0,768994.0,assiasnt manager,9754767388,NaN,NaN
8,9.0,deepak,45.0,86086.0,NaN,6736879400,NaN,NaN
9,10.0,prashant,90.0,86098.0,assisant manager,idk,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
df

,sno,name,age,salary,designation,mobile,Unnamed: 6,Unnamed: 7
0,1.0,shabeeh abbas,23.0,89200.0,manager,9034878439,NaN,NaN
1,2.0,kashish,21.0,70000.0,manager,8798096088,NaN,NaN
2,3.0,nisha,24.0,58809.0,region manager,9890869598,NaN,NaN
3,4.0,kriti,23.0,NaN,region magaer,8181098473,NaN,NaN
4,5.0,aditya sagar,NaN,89765.0,assistant manager,NaN,NaN,NaN
5,6.0,anjani soni,NaN,768659.0,manager,9867698609,NaN,NaN
6,7.0,aishwarya singh,35.0,89900.0,assisant manager,9869743758,NaN,NaN
7,8.0,mayank singh,80.0,768994.0,assiasnt manager,9754767388,NaN,NaN
8,9.0,deepak,45.0,86086.0,NaN,6736879400,NaN,NaN
9,10.0,prashant,90.0,86098.0,assisant manager,idk,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.drop(['mobile','sno','name','Unnamed: 6','Unnamed: 7'],axis=1,inplace=True)
df

     age    salary        designation
0   23.0   89200.0            manager
1   21.0   70000.0            manager
2   24.0   58809.0     region manager
3   23.0       NaN      region magaer
4    NaN   89765.0  assistant manager
5    NaN  768659.0            manager
6   35.0   89900.0   assisant manager
7   80.0  768994.0   assiasnt manager
8   45.0   86086.0                NaN
9   90.0   86098.0   assisant manager
10   NaN       NaN                NaN
11   NaN       NaN                NaN
12   NaN       NaN                NaN
13   NaN       NaN                NaN

In [ ]:
from sklearn.impute import SimpleImputer

In [ ]:
imputer = SimpleImputer()

In [ ]:
# trail run 
cols = ['age','salary']
imputer.fit_transform(df[cols])

array([[2.30000000e+01, 8.92000000e+04],
       [2.10000000e+01, 7.00000000e+04],
       [2.40000000e+01, 5.88090000e+04],
       [2.30000000e+01, 2.34167889e+05],
       [4.26250000e+01, 8.97650000e+04],
       [4.26250000e+01, 7.68659000e+05],
       [3.50000000e+01, 8.99000000e+04],
       [8.00000000e+01, 7.68994000e+05],
       [4.50000000e+01, 8.60860000e+04],
       [9.00000000e+01, 8.60980000e+04],
       [4.26250000e+01, 2.34167889e+05],
       [4.26250000e+01, 2.34167889e+05],
       [4.26250000e+01, 2.34167889e+05],
       [4.26250000e+01, 2.34167889e+05]])

In [ ]:
# final run
cols = ['age','salary']
df[cols]=imputer.fit_transform(df[cols])

In [ ]:
df

       age         salary        designation
0   23.000   89200.000000            manager
1   21.000   70000.000000            manager
2   24.000   58809.000000     region manager
3   23.000  234167.888889      region magaer
4   42.625   89765.000000  assistant manager
5   42.625  768659.000000            manager
6   35.000   89900.000000   assisant manager
7   80.000  768994.000000   assiasnt manager
8   45.000   86086.000000                NaN
9   90.000   86098.000000   assisant manager
10  42.625  234167.888889                NaN
11  42.625  234167.888889                NaN
12  42.625  234167.888889                NaN
13  42.625  234167.888889                NaN

In [ ]:
df['designation'].value_counts()

manager              3
assisant manager     2
region manager       1
region magaer        1
assistant manager    1
assiasnt manager     1
Name: designation, dtype: int64

In [ ]:
# trail run
imp2 = SimpleImputer(strategy = 'most_frequent')
imp2.fit_transform(df[['designation']])

array([['manager'],
       ['manager'],
       ['region manager'],
       ['region magaer'],
       ['assistant manager'],
       ['manager'],
       ['assisant manager'],
       ['assiasnt manager'],
       ['manager'],
       ['assisant manager'],
       ['manager'],
       ['manager'],
       ['manager'],
       ['manager']], dtype=object)

In [ ]:
# actual run 
df['designation'] = imp2.fit_transform(df[['designation']])
df

       age         salary        designation
0   23.000   89200.000000            manager
1   21.000   70000.000000            manager
2   24.000   58809.000000     region manager
3   23.000  234167.888889      region magaer
4   42.625   89765.000000  assistant manager
5   42.625  768659.000000            manager
6   35.000   89900.000000   assisant manager
7   80.000  768994.000000   assiasnt manager
8   45.000   86086.000000            manager
9   90.000   86098.000000   assisant manager
10  42.625  234167.888889            manager
11  42.625  234167.888889            manager
12  42.625  234167.888889            manager
13  42.625  234167.888889            manager

In [ ]:
gender = ['male','female']*7

In [ ]:
df['Gender'] = gender

In [ ]:
# rename columns
df.rename({'salary':'pay'},axis = 1,inplace=True)

In [ ]:
df

       age            pay        designation  Gender
0   23.000   89200.000000            manager    male
1   21.000   70000.000000            manager  female
2   24.000   58809.000000     region manager    male
3   23.000  234167.888889      region magaer  female
4   42.625   89765.000000  assistant manager    male
5   42.625  768659.000000            manager  female
6   35.000   89900.000000   assisant manager    male
7   80.000  768994.000000   assiasnt manager  female
8   45.000   86086.000000            manager    male
9   90.000   86098.000000   assisant manager  female
10  42.625  234167.888889            manager    male
11  42.625  234167.888889            manager  female
12  42.625  234167.888889            manager    male
13  42.625  234167.888889            manager  female

In [56]:
row = [{'age':19,'pay':93291,'designation':'assistant','Gender':'male'}]

In [57]:
df = df.append(row,ignore_index=True)

C:\Users\aishw\AppData\Local\Temp\ipykernel_1572\2124242261.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(row,ignore_index=True)

In [ ]:
df

       age            pay        designation  Gender
0   23.000   89200.000000            manager    male
1   21.000   70000.000000            manager  female
2   24.000   58809.000000     region manager    male
3   23.000  234167.888889      region magaer  female
4   42.625   89765.000000  assistant manager    male
5   42.625  768659.000000            manager  female
6   35.000   89900.000000   assisant manager    male
7   80.000  768994.000000   assiasnt manager  female
8   45.000   86086.000000            manager    male
9   90.000   86098.000000   assisant manager  female
10  42.625  234167.888889            manager    male
11  42.625  234167.888889            manager  female
12  42.625  234167.888889            manager    male
13  42.625  234167.888889            manager  female
14  19.000   93291.000000          assistant    male

In [ ]:
df['Gender'].value_counts()

male      8
female    7
Name: Gender, dtype: int64

In [58]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
gender_enc = LabelEncoder()
gender_enc.fit(df['Gender'])
df

       age            pay        designation  Gender
0   23.000   89200.000000            manager    male
1   21.000   70000.000000            manager  female
2   24.000   58809.000000     region manager    male
3   23.000  234167.888889      region magaer  female
4   42.625   89765.000000  assistant manager    male
5   42.625  768659.000000            manager  female
6   35.000   89900.000000   assisant manager    male
7   80.000  768994.000000   assiasnt manager  female
8   45.000   86086.000000            manager    male
9   90.000   86098.000000   assisant manager  female
10  42.625  234167.888889            manager    male
11  42.625  234167.888889            manager  female
12  42.625  234167.888889            manager    male
13  42.625  234167.888889            manager  female
14  19.000   93291.000000          assistant    male

In [ ]:
gender_enc.transform(df['Gender'])
df

       age            pay        designation  Gender
0   23.000   89200.000000            manager    male
1   21.000   70000.000000            manager  female
2   24.000   58809.000000     region manager    male
3   23.000  234167.888889      region magaer  female
4   42.625   89765.000000  assistant manager    male
5   42.625  768659.000000            manager  female
6   35.000   89900.000000   assisant manager    male
7   80.000  768994.000000   assiasnt manager  female
8   45.000   86086.000000            manager    male
9   90.000   86098.000000   assisant manager  female
10  42.625  234167.888889            manager    male
11  42.625  234167.888889            manager  female
12  42.625  234167.888889            manager    male
13  42.625  234167.888889            manager  female
14  19.000   93291.000000          assistant    male

In [ ]:
df['Gender']=gender_enc.transform(df['Gender'])
df

       age            pay        designation  Gender
0   23.000   89200.000000            manager       1
1   21.000   70000.000000            manager       0
2   24.000   58809.000000     region manager       1
3   23.000  234167.888889      region magaer       0
4   42.625   89765.000000  assistant manager       1
5   42.625  768659.000000            manager       0
6   35.000   89900.000000   assisant manager       1
7   80.000  768994.000000   assiasnt manager       0
8   45.000   86086.000000            manager       1
9   90.000   86098.000000   assisant manager       0
10  42.625  234167.888889            manager       1
11  42.625  234167.888889            manager       0
12  42.625  234167.888889            manager       1
13  42.625  234167.888889            manager       0
14  19.000   93291.000000          assistant       1

In [ ]:
gender_enc.classes_

array(['female', 'male'], dtype=object)

In [ ]:
gender_enc.inverse_transform([0,1,1])
df

       age            pay        designation  Gender
0   23.000   89200.000000            manager       1
1   21.000   70000.000000            manager       0
2   24.000   58809.000000     region manager       1
3   23.000  234167.888889      region magaer       0
4   42.625   89765.000000  assistant manager       1
5   42.625  768659.000000            manager       0
6   35.000   89900.000000   assisant manager       1
7   80.000  768994.000000   assiasnt manager       0
8   45.000   86086.000000            manager       1
9   90.000   86098.000000   assisant manager       0
10  42.625  234167.888889            manager       1
11  42.625  234167.888889            manager       0
12  42.625  234167.888889            manager       1
13  42.625  234167.888889            manager       0
14  19.000   93291.000000          assistant       1

In [59]:
from sklearn.preprocessing import OneHotEncoder

In [60]:
desig_enc = OneHotEncoder()
desig_enc.fit(df[['designation']])

OneHotEncoder()

In [ ]:
designation_dummies = desig_enc.transform(df[['designation']]).toarray()
designation_dummies

array([[0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1.],
       [0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0.]])

In [ ]:
df.drop(columns=['designation'],axis=1,inplace=True)

In [ ]:
import numpy as np

In [ ]:
data = np.hstack((designation_dummies,df.values))
data.shape

(15, 10)

In [ ]:
# option 2 (better version)
desig_dummy_df = pd.DataFrame(designation_dummies)
desig_dummy_df.head()

     0    1    2    3    4    5    6
0  0.0  0.0  0.0  0.0  1.0  0.0  0.0
1  0.0  0.0  0.0  0.0  1.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0  0.0  1.0
3  0.0  0.0  0.0  0.0  0.0  1.0  0.0
4  0.0  0.0  0.0  1.0  0.0  0.0  0.0

In [ ]:
data_df = pd.concat([desig_dummy_df,df],axis=1)

In [ ]:
data_df

      0    1    2    3    4    5    6     age            pay  Gender
0   0.0  0.0  0.0  0.0  1.0  0.0  0.0  23.000   89200.000000       1
1   0.0  0.0  0.0  0.0  1.0  0.0  0.0  21.000   70000.000000       0
2   0.0  0.0  0.0  0.0  0.0  0.0  1.0  24.000   58809.000000       1
3   0.0  0.0  0.0  0.0  0.0  1.0  0.0  23.000  234167.888889       0
4   0.0  0.0  0.0  1.0  0.0  0.0  0.0  42.625   89765.000000       1
5   0.0  0.0  0.0  0.0  1.0  0.0  0.0  42.625  768659.000000       0
6   0.0  1.0  0.0  0.0  0.0  0.0  0.0  35.000   89900.000000       1
7   1.0  0.0  0.0  0.0  0.0  0.0  0.0  80.000  768994.000000       0
8   0.0  0.0  0.0  0.0  1.0  0.0  0.0  45.000   86086.000000       1
9   0.0  1.0  0.0  0.0  0.0  0.0  0.0  90.000   86098.000000       0
10  0.0  0.0  0.0  0.0  1.0  0.0  0.0  42.625  234167.888889       1
11  0.0  0.0  0.0  0.0  1.0  0.0  0.0  42.625  234167.888889       0
12  0.0  0.0  0.0  0.0  1.0  0.0  0.0  42.625  234167.888889       1
13  0.0  0.0  0.0  0.0  1.0  0.0  0.0  42.625  234167.888889       0
14  0.0  0.0  1.0  0.0  0.0  0.0  0.0  19.000   93291.000000       1

In [61]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler

In [62]:
mxScalar = MinMaxScaler()
mxScalar.fit(data_df)
scaled_data = mxScalar.transform(data_df)
print(scaled_data)

[[0.         0.         0.         0.         1.         0.
  0.         0.05633803 0.04279308 1.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.02816901 0.01575787 0.        ]
 [0.         0.         0.         0.         0.         0.
  1.         0.07042254 0.         1.        ]
 [0.         0.         0.         0.         0.         1.
  0.         0.05633803 0.24692001 0.        ]
 [0.         0.         0.         1.         0.         0.
  0.         0.33274648 0.04358864 1.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.33274648 0.99952829 0.        ]
 [0.         1.         0.         0.         0.         0.
  0.         0.22535211 0.04377873 1.        ]
 [1.         0.         0.         0.         0.         0.
  0.         0.85915493 1.         0.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.36619718 0.0384083  1.        ]
 [0.         1.         0.         0.         0.         0.
  0.         1.         0.0384252  0.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.33274648 0.24692001 1.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.33274648 0.24692001 0.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.33274648 0.24692001 1.        ]
 [0.         0.         0.         0.         1.         0.
  0.         0.33274648 0.24692001 0.        ]
 [0.         0.         1.         0.         0.         0.
  0.         0.         0.04855355 1.        ]]

C:\Users\aishw\miniconda3\envs\digi\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
C:\Users\aishw\miniconda3\envs\digi\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [63]:
# this is used in coding
stdScalar = StandardScaler()
stdScalar.fit(data_df)
scaled_data = stdScalar.transform(data_df)
print(scaled_data)

[[-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124 -0.91707454 -0.60451242  0.93541435]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124 -1.01868945 -0.6901222  -1.06904497]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124 -1.06904497 -0.26726124
   3.74165739 -0.86626709 -0.7400211   0.93541435]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124 -1.06904497  3.74165739
  -0.26726124 -0.91707454  0.04187652 -1.06904497]
 [-0.26726124 -0.39223227 -0.26726124  3.74165739 -1.06904497 -0.26726124
  -0.26726124  0.08002174 -0.60199318  0.93541435]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124  0.08002174  2.42508806 -1.06904497]
 [-0.26726124  2.54950976 -0.26726124 -0.26726124 -1.06904497 -0.26726124
  -0.26726124 -0.3073851  -0.60139124  0.93541435]
 [ 3.74165739 -0.39223227 -0.26726124 -0.26726124 -1.06904497 -0.26726124
  -0.26726124  1.97895033  2.42658178 -1.06904497]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124  0.20068944 -0.61839726  0.93541435]
 [-0.26726124  2.54950976 -0.26726124 -0.26726124 -1.06904497 -0.26726124
  -0.26726124  2.48702487 -0.61834375 -1.06904497]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124  0.08002174  0.04187652  0.93541435]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124  0.08002174  0.04187652 -1.06904497]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124  0.08002174  0.04187652  0.93541435]
 [-0.26726124 -0.39223227 -0.26726124 -0.26726124  0.93541435 -0.26726124
  -0.26726124  0.08002174  0.04187652 -1.06904497]
 [-0.26726124 -0.39223227  3.74165739 -0.26726124 -1.06904497 -0.26726124
  -0.26726124 -1.12030436 -0.5862713   0.93541435]]

C:\Users\aishw\miniconda3\envs\digi\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
C:\Users\aishw\miniconda3\envs\digi\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(